{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"mask_zero": false, "name": "embedding_1", "output_dim": 300, "input_dim": 1735541, "batch_input_shape": [null, 500], "embeddings_constraint": null, "dtype": "float32", "activity_regularizer": null, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": false, "input_length": 500}, "class_name": "Embedding"}, {"config": {"name": "bidirectional_1", "trainable": true, "layer": {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "lstm_1", "recurrent_regularizer": null, "return_sequences": false, "implementation": 1, "return_state": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "trainable": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_constraint": null, "units": 300, "stateful": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "activation": "sigmoid", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}